---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisResultSchema.Name
source: html/8f68b360-ffbe-d90f-ce94-cece05c6b451.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisResultSchema.Name Property

Name of analysis result in view

## Syntax (C#)
```csharp
public string Name { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null